In [22]:
import pandas as pd

## Loading Data

In [23]:
loans=pd.read_csv("Loans.csv", header='infer')

In [24]:
loans.head(5)

        MSISDN      Network           Date           Product  Amount
0  27729554427  'Network 1'  '12-Mar-2016'  'Loan Product 1'  1000.0
1  27722342551  'Network 2'  '16-Mar-2016'  'Loan Product 1'  1122.0
2  27725544272  'Network 3'  '17-Mar-2016'  'Loan Product 2'  2084.0
3  27725326345  'Network 1'  '18-Mar-2016'  'Loan Product 2'  3098.0
4  27729234533  'Network 2'  '01-Apr-2016'  'Loan Product 1'  5671.0

## Creating Month from given string

In [25]:
loans['Month']=loans.Date.str[4:7]

In [26]:
loans.head(5)

        MSISDN      Network           Date           Product  Amount Month
0  27729554427  'Network 1'  '12-Mar-2016'  'Loan Product 1'  1000.0   Mar
1  27722342551  'Network 2'  '16-Mar-2016'  'Loan Product 1'  1122.0   Mar
2  27725544272  'Network 3'  '17-Mar-2016'  'Loan Product 2'  2084.0   Mar
3  27725326345  'Network 1'  '18-Mar-2016'  'Loan Product 2'  3098.0   Mar
4  27729234533  'Network 2'  '01-Apr-2016'  'Loan Product 1'  5671.0   Apr

## Grouping data with Aggregation

In [27]:
AgrregationDF = loans.groupby(['Product', 'Network', 'Month']).agg({'Amount': ['sum', 'count']})
# Renaming Column Names 
AgrregationDF.columns = ['Amounts', 'Counts']
AgrregationDF = AgrregationDF.reset_index()

## Creating Tuple for Amounts and Counts

In [28]:
AgrregationDF['tuple_agg'] = AgrregationDF.apply(lambda x: (x.Counts,x.Amounts), axis=1)

## Selecting required Columns

In [29]:
headers = ['Network', 'Product', 'Month', 'tuple_agg']

## Saving output

In [36]:
AgrregationDF.sort_values(['Month','Network'], ascending = True).to_csv('output.csv', columns = headers, index=False)

In [37]:
AgrregationDF

            Product      Network Month  Amounts  Counts    tuple_agg
0  'Loan Product 1'  'Network 1'   Mar   1000.0       1  (1, 1000.0)
1  'Loan Product 1'  'Network 2'   Apr   5671.0       1  (1, 5671.0)
2  'Loan Product 1'  'Network 2'   Mar   1122.0       1  (1, 1122.0)
3  'Loan Product 2'  'Network 1'   Apr   1801.0       1  (1, 1801.0)
4  'Loan Product 2'  'Network 1'   Mar   3098.0       1  (1, 3098.0)
5  'Loan Product 2'  'Network 3'   Mar   2084.0       1  (1, 2084.0)
6  'Loan Product 3'  'Network 2'   Apr   1747.0       1  (1, 1747.0)
7  'Loan Product 3'  'Network 3'   Apr   1928.0       1  (1, 1928.0)

In [38]:
AgrregationDF[headers]

       Network           Product Month    tuple_agg
0  'Network 1'  'Loan Product 1'   Mar  (1, 1000.0)
1  'Network 2'  'Loan Product 1'   Apr  (1, 5671.0)
2  'Network 2'  'Loan Product 1'   Mar  (1, 1122.0)
3  'Network 1'  'Loan Product 2'   Apr  (1, 1801.0)
4  'Network 1'  'Loan Product 2'   Mar  (1, 3098.0)
5  'Network 3'  'Loan Product 2'   Mar  (1, 2084.0)
6  'Network 2'  'Loan Product 3'   Apr  (1, 1747.0)
7  'Network 3'  'Loan Product 3'   Apr  (1, 1928.0)

## Type of ouput

In [18]:
type((AgrregationDF)['tuple_agg'][1])

tuple